var TRIPLES_ = [
  [ 'Тригуб Борис Владимирович' ],
  [
    'Система электронного документооборота Alfresco',
    'Система электронного документооборота и управления содержанием Drupal',
    'АИС КАИП: автоматизированная информационная система контроля исполнения поручений с модулем Система телесовещаний',
	'АИС электронной промышленно-деловой контрактации',
    'Методика и критерии, позволяющие на основании статистических данных, отражаемых в системе делопроизводства Lotus, установленной в Правительстве региона и подведомственных ему организаций, оценивать эффективность работы с документами пользователей указанной системы'	
  ],
  [
    'Внедрение электронного архива организации',
    'Оптимизация бизнес-процессов в области документооборота в организации',
    'Оптимизация бизнес-процессов в области исполнения поручений в организации',
    'Предложение по внедрению единой системы документооборота и взаимодействия с органами государственной власти региона на платной основе с разработкой показателей оценки эффективности деятельности сотрудников казенных, бюджетных и автономных учреждениях региона',
    'Анализ текущего статуса исполнения долгосрочной региональной целевой программы по внедрению и использованию инновационной информаицонной инфраструктуры',
	'Ключевые показатели эффективности использования инновационной информаицонной инфраструктуры'
  ],
  [ 'Тригуб Борис Владимирович', 'Алятина Юлия Юрьевна' ],
  [
    'АИС КАИП: автоматизированная информационная система контроля исполнения поручений с модулем Система телесовещаний',
    'Система совместной работы на базе Системы телесовещаний'
  ],
  [
    'Лицензионная политика программного обеспечения для государственных учреждений',
    'Оценка стоимости разработки программного обеспечения для государственных учреждений',
    'Выработка ключевых показателей эффективности при исполнении поручений в организации'
  ],
  [ 'Тригуб Борис Владимирович', 'Дерюгина Оксана Анатольевна' ],
  [
    'Система трансляции мероприятий и проведения телесовещаний (Система Телесовещаний), основанная на Apache Openmeetings',
    'Системы трансляции мероприятий, основанные на серверах red5, erlyvideo, wowza, Adobe Media Server, а также на прикладной программе Adobe Flash Media Live Encoder',
    'Системы проведения телесовещаний Пульс, Oovoo, Skype, Hangouts',
    'Система IP-телефонии, основанная на сервере Asterisk'
  ],
  [
    'Консолидация опыта проведения конференций коалиции Общероссийский народный фронт',
    'Консолидация опыта проведения конференций партии Единая Россия',
    'Консолидация оборудования конференц-зала при проведении мероприятий высокого уровня',
    'Организация видеомоста с Институтом Бака (Калифорния)',
    'Организация видеомоста с Департаментом промышленности и транспорта региона',
    'Устранение проблем канала связи Москва-Калифорния',
    'Организация выступлений и вещания с конференции региональный Российский интернет-форум',
    'Организация технического взаимодействия и осуществление взаимодействия с ТПП Баварии (Нюрнберг) в области поддержки предпринимательства',
    'Организация выступлений и вещания с регионального форума информационных технологий',
    'Организация телемоста с офисом компании Центр финансовых технологий',
    'Организация взаимодействия с rian.ru и ВГТРК при проведении распределенных региональных мероприятий',
    'Создание регламентов на проведение распределенных региональных мероприятий с высоким уровнем качества организации'
  ],
  [ 'Тригуб Борис Владимирович' ],
  [
    'Система телесовещаний',
    'Система трансляции мероприятий, основанная на сервере red5',
    'Шлюз сервера телефонии c Системой телесовещаний по протоколу SIP',
    'Мобильный клиент Linphone',
    'Мобильное приложение Контакты+'
  ],
  [
    'Возможности и практика использования мобильного терминала',
    'Прототип пользовательских интерфейсов',
    'Экспертная оценка стоимости доработок дополнительной функциональности',
    'Обзор принципов организации связи',
    'Обзор управляющих протоколов, используемых для связи',
    'Обзор методов кодирования данных, используемых при коммуникациях (кодеков)',
    'Обзор совместимого оборудования',
    'Практики по работе в корпоративной сети, обходу firewall и других средств корпоративной безопасности',
    'Практики использования нестандартного оборудования (плазменные телевизоры, ТВ-тюнеры)',
    'Стандарты и алгоритмы работы управляющего протокола SIP и кодеков',
    'Нахождение оптимальных параметров перенастройки конфигурации SIP для улучшения качества связи',
    'Проблема потоковой безопасности',
    'Проблема высокой задержки звука',
    'Планы по использованию HTML5, а также мобильных устройств различных производителей'
  ],
  [ 'Тригуб Борис Владимирович' ],  
  [
    'Система телесовещаний',
    'Библиотеки обеспечения функциональности Rich Internet Application (Apache wicket, Bootstrap, jquery)',
    'Библиотеки обеспечения видеотрансляций (dash.js, Adobe Flash, WebRTC)'
  ],
  [
    'Сравнительный анализ работы в разных браузерах (Opera, Firefox, IE, Chrome)',
    'Перспективы использования с точки зрения рисков стабильности и поддержки разнообразных платформ'
  ],
  [ 'Еремина Наталья Викторовна' ], 
  [
    'Инструментарий и методики оценки региональных и муниципальных чиновников региона',
    'Информационная система интернет-мониторинга качества государственных услуг',
    'Интерактивная анкета участника интернет-мониторинга на сайте innoros.ru',
    'Автоматизированная информационная система сбора информации и обработки статистики интернет-мониторинга на сайте innoros.ru'
  ],
  [
    'Разработка методики оценки региональных и муниципальных чиновников в регионе',
    'Оценка региональных и муниципальных чиновников в регионе',
    'Перспективы развития открытого правительства в регионе'
  ],
  [ 'Рущенко Ирина Васильевна' ], 
  [
    'Скрипт для сбора адресной информации в соответствии с профилем пользователя из сети hh.ru, а также для занесения адресной информации, собранной в соответствии с профилем пользователя из сети hh.ru, в базу данных',
    'Скрипт для рассылки приглашений в социальных сетях linkedin.com, moikrug.ru, facebook.com, скрипт для преследования выбранных по критериям пользователей в социальной сети facebook.com',
    'Скрипт для сбора доступных в сети Интернет адресов электронной почты в домене @gmail.com по данному ключевому слову, скрипт для сбора доступных профилей в социальной сети Google+ по данному ключевому слову',
    'Задачи и скрипты для автоматического тестирования математических способностей и мотивации соискателей',
    'Тематические статьи про инновации для сайта innoros.ru',
    'Скрипт мониторинга популярности трендов в сети Интернет'
  ],
  [
    'Продвижение и реклама российских инноваций',
    'Продвижение сайта и конкурсов агентства в социальных медиа',
    'Советы по поиску сотрудников, в том числе в социальных медиа, с автоматизацией проведения собеседований',
    'Инновационные методы продвижения конкурса на лучшую инновационную идею в социальных сетях',
    'Инновационные методы продвижения конкурса IQ в социальных сетях',
    'Инновационные методы продвижения интернет-мониторинга оценки качества государственных услуг в социальных сетях',
    'Инновационные методы продвижения в социальных сетях проекта дистанционного образования (в рамках инвестиционной площадки ВГЛТА)',
    'Продвижение конкурса на лучшую инновационную идею',
    'Реклама целевых программ региона',
    'Продвижение темы ' + LQ + 'Воронеж как кремниевая долина России' + RQ,
    'Продвижение проекта ' + LQ + 'Воронеж: ИТ столица России' + RQ,
    'Продвижение проекта ' + LQ + 'санитарная авиация' + RQ,
    'Анализ современных средств продвижения',
    'Привлечение экспертов в области информационных технологий к решению задач Агентства',
    'Привлечение экспертов в области социологии и методов мониторинга к решению задач Агентства',
    'Привлечение экспертов в области государственнного управления к решению задач Агентства',
    'Привлечение экспертов в области инноваций и инвестиций к решению задач Агентства',
    'Привлечение экспертов в области телекоммуникаций к решению задач Агентства',
    'Привлечение экспертов в области биологии и биомедицины к решению задач Агентства',
    'Установление партнерства с компаниями-технологическими лидерами (Microsoft, Intel, резиденты Сколково)',
    'Привлечение инвесторов для финансирования ИТ-проектов в рамках инновационной площадки',
    'Привлечение инвесторов для финансирования проектов композиционных материалов в рамках инновационной площадки',
	'Привлечение инвесторов для финансирования биотехнологических проектов в рамках инновационной площадки'
  ],
  [ 'Антиликаторов Алексей Александрович' ],  
  [
    'Консалтинговый продукт и инструментарий на основе лучших практик Gartner и Accenture, скорректированных с учетом специфики Государственного заказчика на основе опыта исполнителя, законов и подзаконных актов',
    'Консалтинговый продукт и инструментарий реализации ИТ-стратегии Государственного заказчика, подготовленной Исполнителем на основании собственного опыта, законов и подзаконных актов',
    'Консалтинговый продукт и инструментарий на основе регламентов и нормативных документов организации, законов и подзаконные актов',
    'Консалтинговый продукт, инструментарий и методика ИТ-аудита на основе регламентов и нормативных документов организации, а также в соответствии с опытом предыдущей работы, законами и подзаконными актами',
    'Консалтинговый продукт, инструментарий и методика экспертной оценки в соответствии с лучшими практиками отрасли, опытом предыдущей работы Исполнителя, законами и подзаконными актами'
  ],
  [
    'Сравнение экспертизы ИТ-компаний для осуществления работ по расщеплению платежей ЖКХ',
    'Сравнение экспертизы ИТ-компаний для осуществления работ по созданию интерактивной 3D-карты Инновации региона',
    'Ценообразование ЦОД',
    'Методика оценки экспертизы команды разработчиков',
    'Отражение ответственности сторон за нарушения в области интеллектуальной собственности при составлении договоров на ИТ-консалтинг',
    'Организация технического взаимодействия с ВУЗами региона и осуществление взаимодействия по обсуждению проблем дистанционного образования, образования в области ИТ и стратегии развития региона',
    'Организация технического взаимодействия с ЕИРЦ и осуществление взаимодействия по обсуждению проблем модернизации расчетов',
    'Перспективы системообразующего проекта в области свободного программного обеспечения с включениями элементов дистанционного образования, биржи фрилансеров, репозитория кода',
    'Перспективы проекта по сравнению программ управления инвестиционной деятельностью'
  ],
  [ 'Тригуб Борис Владимирович' ],
  [
    'Консультация эксперта'
  ],  
  [ 'Расследование ДДОС атак и репутационных атак на сервера, в том числе сервера агентства, для влияния на результаты голосования',
    'Оценка стоимости разработки мобильных приложений, необходимых для выполнения задач Агентства',
    'Лучшие практики разработки удобных пользовательских интерфейсов',
    'Создание способов мониторинга надежности ИТ-инфраструктуры Агентства',
    'Текущий статус мониторинга надежности, динамика статуса по результатам предпринятых мер',
    'Расследование репутационных атак в социальных сетях, а также создание способов мониторинга репутационных атак',
    'Анализ патента US 2010/0104158 A1 в области распознавания образов',
    'Анализ технологий 3D печати, в том числе свободных технологий',
    'Регламент регистрации проекта в Сколково',
    'Эффективное использование рабочего места, оснащённого ПК',
    'Лицензионный договор на передачу прав интеллектуальной собственности на статьи',
    'Способы пользования электронной почтой',
    'Настройка мобильного офиса на платформе Android',
    'Консультации по цене на разработку мультимедийных рекламных материалов'
  ],
  [ 'Жигайлов Сергей Николаевич' ],  
  [
    'Кредитный продукт банка',
	'Финансовый продукт инвестиционного фонда, обеспечивающий раунд финансирования',
	'Экспертиза технологического кластера'
  ],
  [
    'Привлечение инвесторов для финансирования ИТ-проектов в рамках инновационной площадки',
    'Привлечение инвесторов для финансирования проектов композиционных материалов в рамках инновационной площадки',
	'Привлечение инвесторов для финансирования биотехнологических проектов в рамках инновационной площадки',
    'Перспективы развития инновационной площадки'	
  ],
  [ 'Еремина Наталья Викторовна', 'Бондарева Наталия Александровна (совм.)' ],
  [
    'База данных соискателей, сотрудников и вакансий, интегрированная с порталом hh.ru',
    'Обучающий курс по управлению временем',
    'Обучающий курс по делегированию полномочий',
    'Обучающий курс по управлению проектами',
    'Обучающий курс по управлению людьми и их компетенциями'
  ],
  [ 'Анализ и оптимизация организационной структуры', 
    'Ведение таблицы компетенций сотрудников',
	'Заполнение вакансий',
	'Учет расписания отпусков специалистов',
    'Обучение совместителей и отпускников, выполняющих смежные функции'
  ],
  [ 'Логинов Владимир Григорьевич', 'Огнивцев Сергей Борисович' ],
  [ 'Модель ' + LQ + 'Жизнь' + RQ + ' Конвея',
    'Модель пространственного роста клетки',
    'Эволюционная модель тележек (генетический алгоритм)',
	'Фрактальные модели (L-системы)'
  ],
  [ 
    'Математические модели в биологии',
    'Реализация математических моделей на веб-сайте',
    'Популяризация математических моделей в биологии'
  ]
];


var TOPICS_ = [
  'Семинар с техническими специалистами по вопросам использования продукта #product в рамках проекта #project',
  'Согласование расписания заседаний технических специалистов об использовании продукта #product по проекту #project',
  'Статистика опроса регионов по использованию продукта #product для проекта #project',
  'Регламентные процедуры обслуживания продукта #product по проекту #project',
  'Рассылка информации по регионам по проекту #project о продукте #product',
  'Содержание информационной рассылки по продукту #product в рамках проекта #project',
  'Основные моменты при общении с регионами, участвующими в проекте #project по продукту #product',
  'Расписание рассылки по тем специалистам проекта #project, кто уже прошел обучение по продукту #product',
  'Буклет по продукту #product для рассылки участникам проекта #project',
  'Вычитывание буклета по продукту #product для рассылки участникам проекта #project',
  'Планерки с техническими специалистами по продукту #product проекта #project',
  'Сбор контактов и номеров телефонов ответственных людей и лиц, принимающих решения, в регионах, использующих продукт #product в рамках проекта #project',
  'Результаты презентации продукта #product по проекту #project',
  'Реклама продукта #product для компенсации трат по проекту #project',
  'Доступ к онлайн-таблице с информацией по технике, контактам, тестированию участников проекта #project, использующих продукт #product',
  'Расписание митингов по использованию продукта #product при проведении проекта #project',
  'Демонстрация продукта #product по проекту #project',
  'Выбор удобного времени для следующего митинга с технарями по проекту #project по проекту #product'
];

TOPICS_.push(
  'Повышение стабильности продукта #product в рамках проекта #project',
  'Настройка модулей клиентского программного обеспечения для безотказной работы продукта #product в рамках проекта #project',
  'Настройка фильтров безопасности продукта #product для безопасной работы в рамках проекта #project',
  'Риски обновления продукта #product и смягчение этих рисков в рамках проекта #project',
  'Оптимизация настроек продукта #product в рамках проекта #project',
  'Проверка и мониторинг работоспособности продукта #product после внесения изменений в рамках проекта #project',
  'Резервное копирование артефактов продукта #product и данных в рамках проекта #project',
  'Регламент восстановление работоспособности инструментария #product у Государственного заказчика из артефактов и данных в рамках проекта #project'
);

TOPICS_.push(
  'Объяснение концепции проекта #project и принципов работы продукта #product, разъяснение выгод для координации деятельности, которые будут достигнуты с помощью внедрения продукта, перспектив развития',
  'Разъяснение принципов организации и обсуждение методики проведения семинаров с техническими специалистами по продукту #product в рамках проекта #project',
  'Согласование списка персоналий и контактов, которые будут привлекаться для работы по проекту #project для работы с продуктом #product, составление информационных писем о проведении распределённых региональных мероприятий',
  'Проведение опроса по регионам, обработка данных полученных в результате опроса, работа с обратной связью от региональных технических специалистов перед использованием продукта #product в рамках проекта #project',
  'Вопросы эффективности: обсуждение инструментов внедрения и вовлеченности всех участников в процесс эффективного внедрения продукта #product в рамках проекта #project, обсуждение технических вопросов  по  внедрению проекта',
  'Обсуждение, подготовка и предоставление буклета по продукту #product в рамках проекта #project для технических специалистов',
  'Обсуждение процесса согласования действий по организации мероприятия и порядка проведения митинга с техническими  специалистами по вопросам использования продукта #product в рамках проекта #project, обсуждение обратной связи',
  'Митинг с техническими специалистами по вопросам использования продукта #product в рамках проекта #project',
  'Проведение презентации продукта #product по проекту #project, проведение комплекса устных ознакомительных  и подготовительных бесед по развитию и  внедрению',
  'Работа по организации сбора данных при проведении распределенных региональных мероприятий с использованием инструментария #product в рамках проекта #project: особенности, на что нужно обратить внимание, разъяснение принципов и типовых  возможностей',
  'Подготовка к презентации работы продукта #product в рамках проекта #project, проведение презентации',
  'Составление информационных писем о проведении распределенных региональных мероприятий с использованием продукта #product в рамках проекта #project',
  'Онлайн-экспертиза инновационного продукта #product, возможности использования в рамках проектов e-commerce и #project',
  'Проведение экспертизы инновационных идей с использованием продукта #product в рамках проекта #project',
  'Опыт написания отчетных документов по государственным контрактам по продукту #product в рамках проекта #project',
  'Анализ падений системы и неправильного распространения сетевых политик на компьютерах пользователей при использовании продукта #product в рамках проекта #project',
  'Анализ текущего статуса мониторинга надежности работы продукта #product в рамках проекта #project, динамика статуса по результатам предпринятых мер, изменение отчетности по мониторингу надежности для своевременного принятия мер по устранению выявляемых недочетов и неполадок'
);

var NUM_TOTAL = 135;
var NUM_Q = 10;

var ALL_TOPICS;

function generateAllTopics() {
  ALL_TOPICS = [];
  var nt = 0;
  var index, i, j, k;
  
  for (index = 0; index < TRIPLES_.length; ) {
    var consultees = TRIPLES_[index++];
    var products = TRIPLES_[index++];
    var projects = TRIPLES_[index++];
	for (i = 0; i < consultees.length; i++) {
	  var consultee = consultees[i];
	  console.log('consultee = ' + consultee);
	  if (!ALL_TOPICS[consultee]) ALL_TOPICS[consultee] = [];
	  for (j = 0; j < products.length; j++) {  
	    var product = products[j];
		//console.log('product = ' + product);
	    for (k = 0; k < projects.length; k++) {
          var project = projects[k];
          var topic = TOPICS_[nt++];
          nt = nt % TOPICS_.length;
          if (topic.indexOf('#product') == -1 || topic.indexOf('#project') == -1) console.log('Error in ' + topic);
          topic = topic.replace('#product', LQ + product + RQ).replace('#project', LQ + project + RQ);
	      ALL_TOPICS.push(topic);
		}
	  }
	}
  }
  
  for (k in ALL_TOPICS) shuffle(ALL_TOPICS[k]);
}

function generate(element) {
  generateAllTopics();

  element.value = '';
  var t = NUM_TOTAL;
  
  while (t > 0) {
    console.log('t = ' + t);
    var consultee = getRandomElement(getKeys(ALL_TOPICS));
	var topics;
	
	console.log('ALL_TOPICS[consultee].length = ' + ALL_TOPICS[consultee].length);
    if (ALL_TOPICS[consultee].length < NUM_Q) {
	  topics = ALL_TOPICS[consultee];
	  delete ALL_TOPICS[consultee];
	} else {
	  topics = extractSubset(ALL_TOPICS[consultee], NUM_Q);
	  console.log('now ALL_TOPICS[consultee].length = ' + ALL_TOPICS[consultee].length);
	}
    console.log('topics.length = ' + topics.length);
  
	var line = consultee + DELIM;
	var pt = packTopics(topics);
    t -= pt.hours;

    topic = getRandomElement(genFunc)(pt);
    topic = topic.replace(new RegExp(LQ + '+', 'g'), LQ).replace(new RegExp(RQ + '+', 'g'), RQ);
    line += topic;
    element.value += line + '\n';
  }
}
